Tag Tool [1.0.5982.3255]

Please report any bugs and feature requests at
<https://github.com/camden-smallwood/TagTool/issues>.

Reading tags...29050 tags loaded.
- Detected target engine version 1.106708 cert_ms23.
- This cache file was built on 3/20/2015 at 2:40 PM.
Reading stringIDs...37422 strings loaded.

Enter "help" to list available commands. Enter "exit" to quit.

tags.dat> echo Halo Reach Shotgun local cosmetic mod for Halo Online Eldewrito MS23 build; made by Bungie; ported by dany5639 using Shockfire's tagtool and Camden's commands;
Halo Reach Shotgun local cosmetic mod for Halo Online Eldewrito MS23 build; made by Bungie; ported by dany5639 using Shockfire's tagtool and Camden's commands; 
tags.dat> echo Halo Reach Shotgun local cosmetic mod for Halo Online Eldewrito MS23 build; made by Bungie; ported by dany5639 using Shockfire's tagtool and Camden's commands;
Halo Reach Shotgun local cosmetic mod for Halo Online Eldewrito MS23 build; made by Bungie; ported by dany5639 using Shockfire's tagtool and Camden's commands; 
tags.dat> XXXX
Unrecognized command: XXXX
Use "help" to list available commands.

tags.dat> 

tags.dat> 

tags.dat> echo

tags.dat> echo

tags.dat> echo Halo Reach Shotgun local cosmetic mod for Halo Online Eldewrito MS23 build; made by Bungie; ported by dany5639 using Shockfire's tagtool and Camden's commands;
Halo Reach Shotgun local cosmetic mod for Halo Online Eldewrito MS23 build; made by Bungie; ported by dany5639 using Shockfire's tagtool and Camden's commands; 
tags.dat> echo Halo Reach Shotgun local cosmetic mod for Halo Online Eldewrito MS23 build; made by Bungie; ported by dany5639 using Shockfire's tagtool and Camden's commands;
Halo Reach Shotgun local cosmetic mod for Halo Online Eldewrito MS23 build; made by Bungie; ported by dany5639 using Shockfire's tagtool and Camden's commands; 
tags.dat> 1EF5
Unrecognized command: 1EF5
Use "help" to list available commands.

tags.dat> 1EF5
Unrecognized command: 1EF5
Use "help" to list available commands.

tags.dat> 1EFB
Unrecognized command: 1EFB
Use "help" to list available commands.

tags.dat> 1EFB
Unrecognized command: 1EFB
Use "help" to list available commands.

tags.dat> 1F3F
Unrecognized command: 1F3F
Use "help" to list available commands.

tags.dat> 1F3F
Unrecognized command: 1F3F
Use "help" to list available commands.

tags.dat> echo Halo Reach Shotgun local cosmetic mod for Halo Online Eldewrito MS23 build; made by Bungie; ported by dany5639 using Shockfire's tagtool and Camden's commands;
Halo Reach Shotgun local cosmetic mod for Halo Online Eldewrito MS23 build; made by Bungie; ported by dany5639 using Shockfire's tagtool and Camden's commands; 
tags.dat> echo Halo Reach Shotgun local cosmetic mod for Halo Online Eldewrito MS23 build; made by Bungie; ported by dany5639 using Shockfire's tagtool and Camden's commands;
Halo Reach Shotgun local cosmetic mod for Halo Online Eldewrito MS23 build; made by Bungie; ported by dany5639 using Shockfire's tagtool and Camden's commands; 
tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 716A
Unrecognized command: 716A
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 716B
Unrecognized command: 716B
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 716C
Unrecognized command: 716C
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 716D
Unrecognized command: 716D
Use "help" to list available commands.

tags.dat> echo Halo Reach Shotgun local cosmetic mod for Halo Online Eldewrito MS23 build; made by Bungie; ported by dany5639 using Shockfire's tagtool and Camden's commands;
Halo Reach Shotgun local cosmetic mod for Halo Online Eldewrito MS23 build; made by Bungie; ported by dany5639 using Shockfire's tagtool and Camden's commands; 
tags.dat> echo Halo Reach Shotgun local cosmetic mod for Halo Online Eldewrito MS23 build; made by Bungie; ported by dany5639 using Shockfire's tagtool and Camden's commands;
Halo Reach Shotgun local cosmetic mod for Halo Online Eldewrito MS23 build; made by Bungie; ported by dany5639 using Shockfire's tagtool and Camden's commands; 
tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 716E
Unrecognized command: 716E
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 716F
Unrecognized command: 716F
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 7170
Unrecognized command: 7170
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 7171
Unrecognized command: 7171
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 7172
Unrecognized command: 7172
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 7173
Unrecognized command: 7173
Use "help" to list available commands.

tags.dat> STOP
Unrecognized command: STOP
Use "help" to list available commands.

tags.dat> 

tags.dat> resourcedata import resources.dat 0108 tags/HRShotgun.raw
Imported 0x9D690 bytes.
Compressed size = 0x420BF

tags.dat> 

tags.dat> importbitmap 716A DDS/shotgun_diffuse.dds    
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 0000716A [Offset = 0x7F041F0, Size = 0x260]

tags.dat> importbitmap 716B DDS/shotgun_zbump.dds      
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 0000716B [Offset = 0x7F04450, Size = 0x260]

tags.dat> importbitmap 716C DDS/shotgun_flat_illum.dds 
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 0000716C [Offset = 0x7F046B0, Size = 0x260]

tags.dat> importbitmap 716D DDS/unsc_decals_diffuse.dds
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 0000716D [Offset = 0x7F04910, Size = 0x260]

tags.dat> 

tags.dat> import 1EF5 tags/hlmt_HRSH
Imported 0x420 bytes.

tags.dat> import 1F3F tags/mode_HRSH3d
Imported 0xD40 bytes.

tags.dat> import 1EFB tags/mode_HRSHfp
Imported 0xD40 bytes.

tags.dat> import 716E tags/shad_HRSHcomp
Imported 0xAE0 bytes.

tags.dat> import 7172 tags/shad_HRSHdeca
Imported 0x1D0 bytes.

tags.dat> import 7173 tags/shad_HRSHillu
Imported 0x320 bytes.

tags.dat> import 716F tags/shad_HRSHmeta
Imported 0xAE0 bytes.

tags.dat> import 7171 tags/shad_HRSHrubb
Imported 0xAE0 bytes.

tags.dat> import 7170 tags/shad_HRSHshin
Imported 0xAE0 bytes.

tags.dat> 

tags.dat> edit 716E
Tag 0x0000716E.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x716E.shader> SpecifyBitmaps
Please enter the base_map index: 716A
Please enter the detail_map index: 0343
Please enter the bump_map index: 716B
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 0379
Done!

tags.dat\0x716E.shader> exitTo tags.dat

tags.dat> edit 716F
Tag 0x0000716F.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x716F.shader> SpecifyBitmaps
Please enter the base_map index: 716A
Please enter the detail_map index: 0343
Please enter the bump_map index: 716B
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 0379
Done!

tags.dat\0x716F.shader> exitTo tags.dat

tags.dat> edit 7170
Tag 0x00007170.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x7170.shader> SpecifyBitmaps
Please enter the base_map index: 716A
Please enter the detail_map index: 0343
Please enter the bump_map index: 716B
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 0379
Done!

tags.dat\0x7170.shader> exitTo tags.dat

tags.dat> edit 7171
Tag 0x00007171.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x7171.shader> SpecifyBitmaps
Please enter the base_map index: 716A
Please enter the detail_map index: 0343
Please enter the bump_map index: 716B
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 0379
Done!

tags.dat\0x7171.shader> exitTo tags.dat

tags.dat> edit 7172
Tag 0x00007172.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x7172.shader> SpecifyBitmaps
Please enter the base_map index: 716D
Please enter the detail_map index: 0343
Done!

tags.dat\0x7172.shader> exitTo tags.dat

tags.dat> edit 7173
Tag 0x00007173.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x7173.shader> SpecifyBitmaps
Please enter the self_illum_map index: 716C
Done!

tags.dat\0x7173.shader> 0343
Unrecognized command: 0343
Use "help" to list available commands.

tags.dat\0x7173.shader> exitTo tags.dat

tags.dat> edit 1EFB
Tag 0x00001EFB.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x1EFB.render_model> SpecifyShaders
Please enter the replacement 0000583C index: 716E
Please enter the replacement 0000583D index: 716F
Please enter the replacement 0000583E index: 7170
Please enter the replacement 0000583F index: 7171
Please enter the replacement 00005840 index: 7172
Please enter the replacement 00005841 index: 7173
Done!

tags.dat\0x1EFB.render_model> exitTo tags.dat

tags.dat> edit 1F3F
Tag 0x00001F3F.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x1F3F.render_model> SpecifyShaders
Please enter the replacement 000059C1 index: 716E
Please enter the replacement 000059C2 index: 716F
Please enter the replacement 000059C3 index: 7170
Please enter the replacement 000059C4 index: 7171
Please enter the replacement 000059C5 index: 7172
Please enter the replacement 000059C6 index: 7173
Done!

tags.dat\0x1F3F.render_model> exitTo tags.dat

tags.dat> 

tags.dat> dumplog reachShotgun.log
