Tag Tool [1.0.5907.15260]

Please report any bugs and feature requests at
<https://github.com/camden-smallwood/TagTool/issues>.

Reading tags...29061 tags loaded.
- Detected target engine version 1.106708 cert_ms23.
- This cache file was built on 20/03/2015 at 14:40.
Reading stringIDs...37422 strings loaded.

Enter "help" to list available commands. Enter "exit" to quit.

tags.dat> echo Halo Reach Magnum local cosmetic mod for Halo Online Eldewrito MS23 build; made by Bungie; ported by dany5639 using Shockfire's tagtool and Camden's commands;
Halo Reach Magnum local cosmetic mod for Halo Online Eldewrito MS23 build; made by Bungie; ported by dany5639 using Shockfire's tagtool and Camden's commands; 
tags.dat> echo Halo Reach Magnum local cosmetic mod for Halo Online Eldewrito MS23 build; made by Bungie; ported by dany5639 using Shockfire's tagtool and Camden's commands;
Halo Reach Magnum local cosmetic mod for Halo Online Eldewrito MS23 build; made by Bungie; ported by dany5639 using Shockfire's tagtool and Camden's commands; 
tags.dat> XXXX
Unrecognized command: XXXX
Use "help" to list available commands.

tags.dat> 

tags.dat> 

tags.dat> echo

tags.dat> echo

tags.dat> 157E
Unrecognized command: 157E
Use "help" to list available commands.

tags.dat> 157E
Unrecognized command: 157E
Use "help" to list available commands.

tags.dat> 115F
Unrecognized command: 115F
Use "help" to list available commands.

tags.dat> 115F
Unrecognized command: 115F
Use "help" to list available commands.

tags.dat> 1177
Unrecognized command: 1177
Use "help" to list available commands.

tags.dat> 1177
Unrecognized command: 1177
Use "help" to list available commands.

tags.dat> 117B
Unrecognized command: 117B
Use "help" to list available commands.

tags.dat> 117B
Unrecognized command: 117B
Use "help" to list available commands.

tags.dat> 20D9
Unrecognized command: 20D9
Use "help" to list available commands.

tags.dat> 20D9
Unrecognized command: 20D9
Use "help" to list available commands.

tags.dat> 2417
Unrecognized command: 2417
Use "help" to list available commands.

tags.dat> 2417
Unrecognized command: 2417
Use "help" to list available commands.

tags.dat> 241E
Unrecognized command: 241E
Use "help" to list available commands.

tags.dat> 241E
Unrecognized command: 241E
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 717A
Unrecognized command: 717A
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 717B
Unrecognized command: 717B
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 717C
Unrecognized command: 717C
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 717D
Unrecognized command: 717D
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 717E
Unrecognized command: 717E
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 717F
Unrecognized command: 717F
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 7180
Unrecognized command: 7180
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 7181
Unrecognized command: 7181
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 7182
Unrecognized command: 7182
Use "help" to list available commands.

tags.dat> 0000
Unrecognized command: 0000
Use "help" to list available commands.

tags.dat> 7183
Unrecognized command: 7183
Use "help" to list available commands.

tags.dat> STOP
Unrecognized command: STOP
Use "help" to list available commands.

tags.dat> 

tags.dat> resourcedata import resources.dat 0047 tags/HRMag.raw
Imported 0x501A0 bytes.
Compressed size = 0x22107

tags.dat> 

tags.dat> import 115F tags/mode_HRMagfpDef
Imported 0xB80 bytes.

tags.dat> import 1177 tags/mode_HRMagfpRed
Imported 0xB80 bytes.

tags.dat> import 117B tags/mode_HRMagfpYel
Imported 0xB80 bytes.

tags.dat> import 20D9 tags/mode_HRMag3dDef
Imported 0xB80 bytes.

tags.dat> import 2417 tags/mode_HRMag3dRed
Imported 0xB80 bytes.

tags.dat> import 241E tags/mode_HRMag3dYel
Imported 0xB80 bytes.

tags.dat> import 717D tags/shad_HRMagcomp
Imported 0xAE0 bytes.

tags.dat> import 7180 tags/shad_HRMagengr
Imported 0xAE0 bytes.

tags.dat> import 717E tags/shad_HRMagmeta
Imported 0xAE0 bytes.

tags.dat> import 717F tags/shad_HRMagshin
Imported 0xAE0 bytes.

tags.dat> import 7181 tags/shad_HRMagilluDef
Imported 0x320 bytes.

tags.dat> import 7182 tags/shad_HRMagilluRed
Imported 0x320 bytes.

tags.dat> import 7183 tags/shad_HRMagilluYel
Imported 0x320 bytes.

tags.dat> 

tags.dat> importbitmap 717A DDS/magnum_diffuse.dds    
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 0000717A [Offset = 0x7F09E80, Size = 0x260]

tags.dat> importbitmap 717B DDS/magnum_zbump.dds      
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 0000717B [Offset = 0x7F0A0E0, Size = 0x260]

tags.dat> importbitmap 717C DDS/magnum_illum.dds 
Loading textures.dat...
Importing image...
Creating a new tag...

All done! The new bitmap tag is:
bitm 0000717C [Offset = 0x7F0A340, Size = 0x260]

tags.dat> 

tags.dat> edit 717D
Tag 0x0000717D.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x717D.shader> SpecifyBitmaps
Please enter the base_map index: 717A
Please enter the detail_map index: 0343
Please enter the bump_map index: 717B
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 0379
Done!

tags.dat\0x717D.shader> exit

tags.dat> edit 717E
Tag 0x0000717E.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x717E.shader> SpecifyBitmaps
Please enter the base_map index: 717A
Please enter the detail_map index: 0343
Please enter the bump_map index: 717B
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 0379
Done!

tags.dat\0x717E.shader> exit

tags.dat> edit 717F
Tag 0x0000717F.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x717F.shader> SpecifyBitmaps
Please enter the base_map index: 717A
Please enter the detail_map index: 0343
Please enter the bump_map index: 717B
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 0379
Done!

tags.dat\0x717F.shader> exit

tags.dat> edit 7180
Tag 0x00007180.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x7180.shader> SpecifyBitmaps
Please enter the base_map index: 717A
Please enter the detail_map index: 0343
Please enter the bump_map index: 717B
Please enter the bump_detail_map index: 0376
Please enter the material_texture index: 02B7
Please enter the environment_map index: 02B9
Please enter the self_illum_map index: 0379
Done!

tags.dat\0x7180.shader> exit

tags.dat> edit 7181
Tag 0x00007181.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x7181.shader> SpecifyBitmaps
Please enter the self_illum_map index: 717C
Done!

tags.dat\0x7181.shader> 0343
Unrecognized command: 0343
Use "help" to list available commands.

tags.dat\0x7181.shader> exit

tags.dat> edit 7182
Tag 0x00007182.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x7182.shader> SpecifyBitmaps
Please enter the self_illum_map index: 717C
Done!

tags.dat\0x7182.shader> 0343
Unrecognized command: 0343
Use "help" to list available commands.

tags.dat\0x7182.shader> exit

tags.dat> edit 7183
Tag 0x00007183.shader has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x7183.shader> SpecifyBitmaps
Please enter the self_illum_map index: 717C
Done!

tags.dat\0x7183.shader> 0343
Unrecognized command: 0343
Use "help" to list available commands.

tags.dat\0x7183.shader> exit

tags.dat> 

tags.dat> edit 115F
Tag 0x0000115F.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x115F.render_model> SpecifyShaders
Please enter the replacement 0000584B index: 717D
Please enter the replacement 0000584C index: 717E
Please enter the replacement 0000584D index: 717F
Please enter the replacement 0000584E index: 7180
Please enter the replacement 0000584F index: 7181
Done!

tags.dat\0x115F.render_model> exit

tags.dat> edit 1177
Tag 0x00001177.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x1177.render_model> SpecifyShaders
Please enter the replacement 0000584B index: 717D
Please enter the replacement 0000584C index: 717E
Please enter the replacement 0000584D index: 717F
Please enter the replacement 0000584E index: 7180
Please enter the replacement 00005850 index: 7182
Done!

tags.dat\0x1177.render_model> exit

tags.dat> edit 117B
Tag 0x0000117B.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x117B.render_model> SpecifyShaders
Please enter the replacement 0000584B index: 717D
Please enter the replacement 0000584C index: 717E
Please enter the replacement 0000584D index: 717F
Please enter the replacement 0000584E index: 7180
Please enter the replacement 00005851 index: 7183
Done!

tags.dat\0x117B.render_model> exit

tags.dat> edit 20D9
Tag 0x000020D9.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x20D9.render_model> SpecifyShaders
Please enter the replacement 0000584B index: 717D
Please enter the replacement 0000584C index: 717E
Please enter the replacement 0000584D index: 717F
Please enter the replacement 0000584E index: 7180
Please enter the replacement 0000584F index: 7181
Done!

tags.dat\0x20D9.render_model> exit

tags.dat> edit 2417
Tag 0x00002417.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x2417.render_model> SpecifyShaders
Please enter the replacement 0000584B index: 717D
Please enter the replacement 0000584C index: 717E
Please enter the replacement 0000584D index: 717F
Please enter the replacement 0000584E index: 7180
Please enter the replacement 00005850 index: 7182
Done!

tags.dat\0x2417.render_model> exit

tags.dat> edit 241E
Tag 0x0000241E.render_model has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.dat.

tags.dat\0x241E.render_model> SpecifyShaders
Please enter the replacement 0000584B index: 717D
Please enter the replacement 0000584C index: 717E
Please enter the replacement 0000584D index: 717F
Please enter the replacement 0000584E index: 7180
Please enter the replacement 00005851 index: 7183
Done!

tags.dat\0x241E.render_model> exit

tags.dat> 

tags.dat> dumplog reachMagnum.log
